[
  {
    "id": "eefc865d-e963-4a30-95af-6346a8497243",
    "timestamp": "2026-02-13T09:39:45.777178",
    "query": "इसे समझाओ",
    "response": "यह दस्तावेज़ Sandilya Moturi का बायोडाटा (resume) है, जो उनके शैक्षणिक पृष्ठभूमि, कार्य अनुभव, तकनीकी कौशल, परियोजनाओं और प्रमाणन को दर्शाता है। इसे पढ़कर, हमें पता चलता है कि Sandilya एक कंप्यूटर साइंस और डिज़ाइन के छात्र हैं जिनके पास सॉफ्टवेयर डेवलपमेंट और वेब टेक्नोलॉजीज में व्यावहारिक अनुभव और कौशल हैं।\n\nयहां दस्तावेज़ का विस्तृत विवरण दिया गया है:\n\n### 1. व्यक्तिगत और संपर्क जानकारी\n*   **नाम:** Sandilya Moturi\n*   **ईमेल:** sandilyamoturi347@gmail.com\n*   **फ़ोन नंबर:** 9985111189\n*   उनके पोर्टफोलियो का उल्लेख है, लेकिन उसका लिंक दस्तावेज़ में उपलब्ध नहीं है।\n\n### 2. शिक्षा (Education)\nSandilya Moturi की शैक्षणिक यात्रा इस प्रकार है:\n*   **SRKR इंजीनियरिंग कॉलेज, भीमावरम (2022 – 2026):** वे कंप्यूटर साइंस और डिज़ाइन में बैचलर ऑफ टेक्नोलॉजी (B.Tech) की पढ़ाई कर रहे हैं।\n*   **सासी जूनियर कॉलेज, तनुकु (2020 – 2022):** उन्होंने MPC (गणित, भौतिकी, रसायन विज्ञान) विषय के साथ इंटरमीडिएट की पढ़ाई पूरी की है।\n\n### 3. कार्य अनुभव (Experience)\n\nSandilya के पास दो प्रमुख कार्य अनुभव हैं, जिनमें वे सॉफ्टवेयर विकास और वेब समाधानों पर काम कर चुके हैं:\n\n*   **सॉफ्टवेयर इंजीनियर इंटर्न (Software Engineer Intern) - Bluconn, भीमावरम (जुलाई 2024 – वर्तमान)**\n    *   **API डेवलपमेंट:** NestJS का उपयोग करके स्केलेबल RESTful APIs (एप्लिकेशन प्रोग्रामिंग इंटरफेस) विकसित और ऑप्टिमाइज़ किए हैं, जो उच्च प्रदर्शन और विश्वसनीयता सुनिश्चित करते हैं। उन्होंने व्यापक एंड-टू-एंड टेस्ट केस भी लिखे हैं।\n    *   **UI डेवलपमेंट:** React का उपयोग करके कर्मचारी प्रबंधन के लिए एक सहज और उपयोगकर्ता-अनुकूल UI (यूजर इंटरफेस) बनाया है।\n    *   **DevOps और क्लाउड:** AWS का उपयोग करके एक मजबूत DevOps पाइपलाइन डिज़ाइन और कार्यान्वित की है, जिसमें सुरक्षित साइनअप प्रमाणीकरण और निर्बाध एकीकरण शामिल है।\n    *   **डेटाबेस और कंटेनर:** PostgreSQL का उपयोग करके एक मजबूत डेटाबेस आर्किटेक्चर डिज़ाइन और लागू किया है, जो डेटा की अखंडता और स्केलेबिलिटी सुनिश्चित करता है। उन्होंने डॉकर (Docker) का उपयोग करके एक कंटेनराइज़्ड वातावरण भी बनाया है, जिससे एप्लिकेशन को आसानी से डिप्लॉय, प्रबंधित और स्केल किया जा सके।\n    *   **ऑटोमेशन:** WhatsApp के साथ एकीकृत एक स्वचालित ओवरटाइम अनुरोध कार्यप्रवाह विकसित किया है, जिससे कर्मचारी चैट इंटरफ़ेस के माध्यम से आसानी से ओवरटाइम अनुरोध सबमिट और ट्रैक कर सकें।\n\n*   **जूनियर डेवलपर (Junior Developer) - MCR Web Solutions, भीमावरम (नवंबर 2023 – वर्तमान)**\n    *   **वेबसाइट डिज़ाइन और विकास:** कई वेबसाइटों को डिज़ाइन और विकसित किया, जिसमें सहज उपयोगकर्ता अनुभव और सहज इंटरफेस को प्राथमिकता दी गई।\n    *   **इवेंट मैनेजमेंट:** 100 से अधिक प्रतिभागियों के लिए 18 घंटे के वेबटेक हैकाथॉन का सफलतापूर्वक आयोजन और निष्पादन किया, जिसमें योजना, समन्वय और लॉजिस्टिक्स सहित सभी पहलुओं का प्रबंधन किया।\n    *   **टीम सहयोग:** कुशल और उपयोगकर्ता-अनुकूल वेबसाइट प्रदान करने के लिए डेवलपर्स और टेक बडीज़ सहित क्रॉस-फंक्शनल टीमों के साथ सहयोग किया, साथ ही कार्य असाइनमेंट, प्रतिभागी प्रबंधन और लॉजिस्टिक्स की देखरेख की।\n\n### 4. कौशल (Skills)\n\nSandilya के पास विभिन्न प्रोग्रामिंग भाषाओं, फ़्रेमवर्क, डेवलपर टूल और डेटाबेस में कौशल हैं:\n\n*   **प्रोग्रामिंग भाषाएँ:** Python, C, HTML, CSS, JavaScript, Java (बुनियादी)।\n*   **फ़्रेमवर्क और लाइब्रेरीज़:** React, React Native, Electron, Puppeteer, Node.js, Express.js।\n*   **डेवलपर टूल्स:** Git, VS Code, Postman, Bitbucket, Thunder Client, Linux।\n*   **डेटाबेस:** MySQL, MongoDB, PostgreSQL, Firebase।\n\n### 5. परियोजनाएँ (Projects)\n\nSandilya ने कई महत्वपूर्ण परियोजनाओं पर काम किया है:\n\n*   **मैजिकल DB (Magical DB):**\n    *   जीन इंटरैक्शन को विज़ुअलाइज़ करने के लिए एक डायनामिक वेबसाइट विकसित की, जिसमें स्पष्ट डिज़ाइन और कुशल डेटाबेस संचालन पर जोर दिया गया।\n    *   HTML, CSS, JS, और PHP का उपयोग करके 23 मिलियन से अधिक जीन इंटरैक्शन को संसाधित किया, जिसमें खोज अनुकूलन पर ध्यान केंद्रित किया गया।\n    *   कुशल स्कीमा डिज़ाइन और जटिल क्वेरी कार्यान्वयन के माध्यम से डेटाबेस प्रदर्शन में सुधार किया।\n    *   साइटोस्केप (Cytoscape) लाइब्रेरी एकीकरण के साथ डेटा विज़ुअलाइज़ेशन को बढ़ाया।\n\n*   **SVCET कॉलेज वेबसाइट (SVCET College Website):**\n    *   एक इंजीनियरिंग कॉलेज वेबसाइट विकसित करने के लिए 10-सदस्यीय टीम के साथ सहयोग किया, छात्रों, फैकल्टी और प्रशासकों की जरूरतों को पूरा करने वाला एक सहज UI डिज़ाइन और कुशल उपयोगकर्ता अनुभव प्रदान किया।\n    *   EmailJS को एकीकृत करके एक मजबूत संचार ढांचा तैयार किया, जिससे ग्राहकों और सहायता टीमों के बीच निर्बाध बातचीत सक्षम हुई; प्रतिक्रिया समय को 40% तक बढ़ाया और ग्राहक संतुष्टि रेटिंग को 15% तक सुधारा।\n    *   HTML, CSS, Bootstrap, JavaScript, PHP, और MySQL सहित एक मजबूत तकनीकी स्टैक का उपयोग किया।\n\n*   **SRKR कॉलेज वेबसाइट (SRKR College Website):**\n    *   एक सहज और प्रतिक्रियाशील UI अनुभव तैयार किया, एक उपयोगकर्ता-अनुकूल इंटरफेस डिज़ाइन और कार्यान्वित किया जो आवश्यक जानकारी और संसाधनों तक आसान नेविगेशन और पहुंच सुनिश्चित करता है।\n    *   कॉलेज की आधिकारिक वेबसाइट के विकास और रखरखाव में महत्वपूर्ण भूमिका निभाई, हितधारकों के साथ मिलकर उनकी जरूरतों और प्राथमिकताओं को पूरा करने वाले समाधानों को डिज़ाइन और कार्यान्वित किया।\n\n### 6. प्रमाणन और अतिरिक्त गतिविधियाँ (Certifications And Extracurricular Activities)\n\nSandilya ने कई प्रमाणन और अतिरिक्त गतिविधियों में भाग लिया है:\n\n*   **कोर्स प्रमाणन:** C, ReactJs, HTML, CSS।\n*   **अन्य प्रमाणन:** स्मार्ट इंडिया हैकाथॉन 24 घंटे [SIH], वर्डप्रेस (WordPress), जेनरेटिव AI (Generative AI)।\n\nसंक्षेप में, Sandilya Moturi एक महत्वाकांक्षी और कुशल छात्र डेवलपर हैं, जिनके पास वेब विकास, API डिज़ाइन, DevOps, डेटाबेस प्रबंधन और परियोजना समन्वय में ठोस अनुभव है। उनके प्रोजेक्ट और कार्य अनुभव उनके तकनीकी कौशल और वास्तविक दुनिया की समस्याओं को हल करने की क्षमता को दर्शाते हैं।\n\n**Would you like me to:**\n• Sandilya की Bluconn इंटर्नशिप में उपयोग की गई किसी एक तकनीक (जैसे NestJS, React, AWS, या Docker) के बारे में विस्तार से समझाऊं?\n• Sandilya के किसी एक प्रोजेक्ट (जैसे Magical DB या SVCET College Website) के मुख्य परिणामों और उपयोग की गई तकनीकों पर गहराई से चर्चा करूं?\n• Create a visual representation of this data",
    "query_type": "general",
    "confidence": 17.015758156776428,
    "sources": [
      {
        "chunk_text": "Sandilya Moturi \n sandilyamoturi347@gmail.com \n 9985111189 \n MyPortFolio \n Sandilya Moturi \n Sandilya Moturi \nEducation \nSRKR Engineering College, \nBachelor of Technology in Computer Science and Design \nSasi Junior College, \nIntermediate , MPC \nExperience \nSoftware Engineer Intern \nBluconn \n2022 – 2026 \nBhimavaram \n2020 – 2022 \nTanuku \n \n \n   Bhimavarm     \nJuly 2024 – present \n◦ Developed and optimized scalable RESTful APIs using NestJS, ensuring high performance and reliability, and wrote comprehensive end-to-\nend test cases to guarantee seamless functionality. \n◦ Crafted a seamless and user-friendly UI for employee management using React, providing an intuitive and engaging experience for users, and \nstreamlining workflows through a responsive and interactive interface. \n◦ Designed and implemented a robust DevOps pipeline using AWS, leveraging its capabilities for secure signup authentication and seamless \nintegration. \n◦ Designed and implemented a robust database architecture using PostgreSQL, ensuring data integrity and scalability, and utilized Docker to \ncreate a containerized environment, enabling easy deployment, management, and scaling of applications. \n◦ Developed an automated overtime request workflow integrated with WhatsApp, enabling employees to easily submit and track overtime \nrequests through a user-friendly chat interface. \nJunior Developer \nMCR Web Solutions \nBhimavarm \nNov 2023 – present \n◦ Designed and developed multiple websites, prioritizing seamless user experiences and intuitive interfaces. \n◦ Successfully organized and executed an 18-hour WebTech Hackathon, managing all aspects of the event, including planning, coordination, and \nlogistics, for over 100 participants. \n◦ Collaborated with cross-functional teams, including developers and tech buddies, to deliver efficient and user- friendly websites, while \noverseeing task assignments, participant management, and logistics. \nSkills \nProgramming Languages: Python, C, HTML, CSS, JavaScript, Java (Basics)  \nFrameworks & Libraries: React, React Native, Electron, Puppeteer, Node.js, Express.js \nDeveloper Tools: Git, VS Code, Postman, Bitbucket, Thunder Client, Linux  \nDatabases: MySQL, MongoDB, PostgreSQL, Firebase \nProjects \nMagical DB \nLink \n \n◦ I developed a dynamic website for visualizing gene interactions, emphasizing clear design and efficient database operations. Continuous \niteration and refinement ensured smooth functionality, optimized user understanding, and streamlined navigation. \n◦ Processed 23M+ gene interactions using HTML, CSS, JS, and PHP, with a focus on search optimization. Im- proved database performance \nthrough efficient schema design and complex query implementation. Enhanced data visualization with Cytoscape library integration. \nSVCET College Website \nLink \n \n◦ Collaborated with a 10-member team to develop an engineering college website, delivering a seamless UI design and efficient user \nexperience that catered to the needs of students, faculty, and administrators. \n◦ Engineered a robust communication framework by integrating EmailJS, enabling seamless interaction between customers and support \nteams; boosted response times by 40% and improved customer satisfaction ratings by 15%. \n◦ Utilized a robust tech stack, including HTML, CSS, Bootstrap, JavaScript, PHP, and MySQL, to deliver a scalable and efficient website \nsolution. \nSRKR College Website \nLink \n \n◦ Crafted an intuitive and responsive UI experience, designing and implementing a user-friendly interface that ensured easy navigation and \naccess to essential information and resources. This included optimizing the website for various devices and screen sizes, ensuring a \nconsistent user experience across different platforms. \n◦ Played a pivotal role in the development and maintenance of our college’s official website , collaborating with stakeholders to design and \nimplement solutions that met their needs and preferences. \n \nCertifications And Extracurricular Activities \nCertification of Courses: C, ReactJs, HTML, CSS \n \n \n \n               Link \n \nCertifications: Smart India Hackathon 24Hrs [SIH], WordPress, Generative AI",
        "metadata": {
          "chunk_length": 4148,
          "upload_time": "2026-02-12T21:35:33.662553",
          "document_type": "General Document",
          "processing_date": "2026-02-12T21:35:32.906936",
          "creation_date": "",
          "document_id": "fcbfad1c-7f7e-424e-8312-8c8cf1804f7b",
          "word_count": 536,
          "tables_count": 0,
          "document_name": "Resume__Pro.pdf",
          "chunk_type": "paragraph_based",
          "subject": "",
          "char_count": 4151,
          "original_filename": "Resume__Pro.pdf",
          "title": "",
          "summary": "This document is Sandilya Moturi's professional resume, detailing his academic qualifications, extensive work experience, and technical expertise. He is currently a Software Engineer Intern at Bluconn, focusing on developing scalable RESTful APIs, crafting user-friendly UIs with React, implementing AWS DevOps pipelines, and designing robust PostgreSQL databases. Concurrently, as a Junior Developer at MCR Web Solutions, he has designed multiple websites and successfully organized a large WebTech Hackathon. His portfolio highlights strong skills in full-stack development, including Python, JavaScript, React, Node.js, and various databases, showcased through projects like a gene interaction visualization tool and several college website developments.",
          "creator": "",
          "images_count": 6,
          "stored_file_path": "uploads\\5d1c4a08-ea8c-47a2-949a-112865524347.pdf",
          "topics": "[]",
          "author": "",
          "estimated_reading_time": "2 minutes",
          "pages": 1,
          "chunk_id": 0
        },
        "similarity_score": 0.34031516313552856,
        "quality_score": 0.49031516313552853,
        "distance": 0.6596848368644714,
        "relevance_rank": 1
      }
    ],
    "chart_data": null,
    "has_chart": false,
    "chart_type": null
  },
  {
    "id": "b0a7ee94-47a8-403a-839e-fbb3b27a84c9",
    "timestamp": "2026-02-13T10:56:45.108146",
    "query": "explain",
    "response": "This document is the resume of **Sandilya Moturi**, showcasing their educational background, professional experience, technical skills, significant projects, and certifications. It provides a comprehensive overview of their capabilities and achievements in the field of computer science and software development.\n\nHere's a detailed breakdown of the document's content:\n\n### 1. Contact Information\n*   **Name:** Sandilya Moturi\n*   **Email:** sandilyamoturi347@gmail.com\n*   **Phone:** 9985111189\n*   **Portfolio:** A link to \"MyPortFolio\" is mentioned, though the specific URL is not provided in the text.\n\n### 2. Education\nSandilya has a strong academic foundation:\n*   **SRKR Engineering College:** Currently pursuing a Bachelor of Technology (B.Tech) in Computer Science and Design from 2022 to 2026 in Bhimavaram. This indicates a focus on both the technical and aesthetic aspects of software development.\n*   **Sasi Junior College:** Completed Intermediate (equivalent to 10+2) with MPC (Mathematics, Physics, Chemistry) from 2020 to 2022 in Tanuku.\n\n### 3. Experience\nSandilya has practical experience in software development roles:\n\n*   **Software Engineer Intern at Bluconn (July 2024 – present, Bhimavarm):**\n    *   **Backend Development:** Developed and optimized scalable RESTful APIs using **NestJS**, focusing on high performance and reliability. Wrote comprehensive end-to-end test cases for seamless functionality.\n    *   **Frontend Development:** Crafted a seamless and user-friendly UI for employee management using **React**, ensuring an intuitive, engaging, responsive, and interactive experience.\n    *   **DevOps & Cloud:** Designed and implemented a robust DevOps pipeline utilizing **AWS** for secure signup authentication and seamless integration.\n    *   **Database & Containerization:** Designed and implemented a robust database architecture using **PostgreSQL** for data integrity and scalability, and used **Docker** for containerization, enabling easy deployment and management.\n    *   **Automation:** Developed an automated overtime request workflow integrated with **WhatsApp**, allowing employees to submit and track requests via a user-friendly chat interface.\n\n*   **Junior Developer at MCR Web Solutions (Nov 2023 – present, Bhimavarm):**\n    *   **Web Development:** Designed and developed multiple websites, prioritizing seamless user experiences and intuitive interfaces.\n    *   **Event Management:** Successfully organized and executed an 18-hour WebTech Hackathon for over 100 participants, managing all aspects from planning to logistics.\n    *   **Collaboration:** Collaborated with cross-functional teams (developers, tech buddies) to deliver efficient and user-friendly websites, and oversaw task assignments and participant management.\n\n### 4. Skills\nSandilya possesses a diverse skill set covering various aspects of software development:\n*   **Programming Languages:** Python, C, HTML, CSS, JavaScript, Java (Basics)\n*   **Frameworks & Libraries:** React, React Native, Electron, Puppeteer, Node.js, Express.js\n*   **Developer Tools:** Git, VS Code, Postman, Bitbucket, Thunder Client, Linux\n*   **Databases:** MySQL, MongoDB, PostgreSQL, Firebase\n\n### 5. Projects\nSeveral significant projects demonstrate Sandilya's practical application of skills:\n\n*   **Magical DB:**\n    *   **Purpose:** Developed a dynamic website for visualizing gene interactions, with a focus on clear design and efficient database operations.\n    *   **Key Contributions:** Processed over 23 million gene interactions using **HTML, CSS, JS, and PHP**. Improved database performance through efficient schema design and complex query implementation. Enhanced data visualization by integrating the **Cytoscape library**.\n\n*   **SVCET College Website:**\n    *   **Collaboration:** Collaborated with a 10-member team to develop an engineering college website, delivering a seamless UI and efficient user experience for students, faculty, and administrators.\n    *   **Communication Framework:** Engineered a robust communication framework by integrating **EmailJS**, which boosted response times by 40% and improved customer satisfaction ratings by 15%.\n    *   **Tech Stack:** Utilized HTML, CSS, Bootstrap, JavaScript, PHP, and MySQL for a scalable and efficient solution.\n\n*   **SRKR College Website:**\n    *   **UI/UX Design:** Crafted an intuitive and responsive UI experience, ensuring easy navigation and access to essential information across various devices and screen sizes.\n    *   **Stakeholder Collaboration:** Played a pivotal role in the development and maintenance of the college's official website, collaborating with stakeholders to design and implement solutions aligned with their needs.\n\n### 6. Certifications And Extracurricular Activities\n*   **Course Certifications:** C, ReactJs, HTML, CSS\n*   **Other Certifications:** Smart India Hackathon 24Hrs (SIH), WordPress, Generative AI\n\nIn summary, Sandilya Moturi is an aspiring Computer Science and Design professional with hands-on experience in full-stack development (MERN/PERN stack), DevOps practices, database design, and project management. Their resume highlights strong technical skills, a collaborative approach, and a focus on delivering user-centric and efficient software solutions, backed by practical projects and academic pursuits.\n\n**Would you like me to:**\n• Elaborate on Sandilya's experience with specific technologies like NestJS or AWS?\n• Compare the responsibilities and achievements from the Software Engineer Intern and Junior Developer roles?\n• Create a visual representation of this data",
    "query_type": "general",
    "confidence": 18.63115429878235,
    "sources": [
      {
        "chunk_text": "Sandilya Moturi \n sandilyamoturi347@gmail.com \n 9985111189 \n MyPortFolio \n Sandilya Moturi \n Sandilya Moturi \nEducation \nSRKR Engineering College, \nBachelor of Technology in Computer Science and Design \nSasi Junior College, \nIntermediate , MPC \nExperience \nSoftware Engineer Intern \nBluconn \n2022 – 2026 \nBhimavaram \n2020 – 2022 \nTanuku \n \n \n   Bhimavarm     \nJuly 2024 – present \n◦ Developed and optimized scalable RESTful APIs using NestJS, ensuring high performance and reliability, and wrote comprehensive end-to-\nend test cases to guarantee seamless functionality. \n◦ Crafted a seamless and user-friendly UI for employee management using React, providing an intuitive and engaging experience for users, and \nstreamlining workflows through a responsive and interactive interface. \n◦ Designed and implemented a robust DevOps pipeline using AWS, leveraging its capabilities for secure signup authentication and seamless \nintegration. \n◦ Designed and implemented a robust database architecture using PostgreSQL, ensuring data integrity and scalability, and utilized Docker to \ncreate a containerized environment, enabling easy deployment, management, and scaling of applications. \n◦ Developed an automated overtime request workflow integrated with WhatsApp, enabling employees to easily submit and track overtime \nrequests through a user-friendly chat interface. \nJunior Developer \nMCR Web Solutions \nBhimavarm \nNov 2023 – present \n◦ Designed and developed multiple websites, prioritizing seamless user experiences and intuitive interfaces. \n◦ Successfully organized and executed an 18-hour WebTech Hackathon, managing all aspects of the event, including planning, coordination, and \nlogistics, for over 100 participants. \n◦ Collaborated with cross-functional teams, including developers and tech buddies, to deliver efficient and user- friendly websites, while \noverseeing task assignments, participant management, and logistics. \nSkills \nProgramming Languages: Python, C, HTML, CSS, JavaScript, Java (Basics)  \nFrameworks & Libraries: React, React Native, Electron, Puppeteer, Node.js, Express.js \nDeveloper Tools: Git, VS Code, Postman, Bitbucket, Thunder Client, Linux  \nDatabases: MySQL, MongoDB, PostgreSQL, Firebase \nProjects \nMagical DB \nLink \n \n◦ I developed a dynamic website for visualizing gene interactions, emphasizing clear design and efficient database operations. Continuous \niteration and refinement ensured smooth functionality, optimized user understanding, and streamlined navigation. \n◦ Processed 23M+ gene interactions using HTML, CSS, JS, and PHP, with a focus on search optimization. Im- proved database performance \nthrough efficient schema design and complex query implementation. Enhanced data visualization with Cytoscape library integration. \nSVCET College Website \nLink \n \n◦ Collaborated with a 10-member team to develop an engineering college website, delivering a seamless UI design and efficient user \nexperience that catered to the needs of students, faculty, and administrators. \n◦ Engineered a robust communication framework by integrating EmailJS, enabling seamless interaction between customers and support \nteams; boosted response times by 40% and improved customer satisfaction ratings by 15%. \n◦ Utilized a robust tech stack, including HTML, CSS, Bootstrap, JavaScript, PHP, and MySQL, to deliver a scalable and efficient website \nsolution. \nSRKR College Website \nLink \n \n◦ Crafted an intuitive and responsive UI experience, designing and implementing a user-friendly interface that ensured easy navigation and \naccess to essential information and resources. This included optimizing the website for various devices and screen sizes, ensuring a \nconsistent user experience across different platforms. \n◦ Played a pivotal role in the development and maintenance of our college’s official website , collaborating with stakeholders to design and \nimplement solutions that met their needs and preferences. \n \nCertifications And Extracurricular Activities \nCertification of Courses: C, ReactJs, HTML, CSS \n \n \n \n               Link \n \nCertifications: Smart India Hackathon 24Hrs [SIH], WordPress, Generative AI",
        "metadata": {
          "document_name": "Resume__Pro.pdf",
          "topics": "[]",
          "chunk_length": 4148,
          "author": "",
          "creation_date": "",
          "document_type": "General Document",
          "original_filename": "Resume__Pro.pdf",
          "images_count": 6,
          "chunk_type": "paragraph_based",
          "subject": "",
          "char_count": 4151,
          "estimated_reading_time": "2 minutes",
          "pages": 1,
          "creator": "",
          "tables_count": 0,
          "upload_time": "2026-02-12T21:35:33.662553",
          "processing_date": "2026-02-12T21:35:32.906936",
          "word_count": 536,
          "title": "",
          "chunk_id": 0,
          "summary": "This document is Sandilya Moturi's professional resume, detailing his academic qualifications, extensive work experience, and technical expertise. He is currently a Software Engineer Intern at Bluconn, focusing on developing scalable RESTful APIs, crafting user-friendly UIs with React, implementing AWS DevOps pipelines, and designing robust PostgreSQL databases. Concurrently, as a Junior Developer at MCR Web Solutions, he has designed multiple websites and successfully organized a large WebTech Hackathon. His portfolio highlights strong skills in full-stack development, including Python, JavaScript, React, Node.js, and various databases, showcased through projects like a gene interaction visualization tool and several college website developments.",
          "document_id": "fcbfad1c-7f7e-424e-8312-8c8cf1804f7b",
          "stored_file_path": "uploads\\5d1c4a08-ea8c-47a2-949a-112865524347.pdf"
        },
        "similarity_score": 0.372623085975647,
        "quality_score": 0.522623085975647,
        "distance": 0.627376914024353,
        "relevance_rank": 1
      }
    ],
    "chart_data": null,
    "has_chart": false,
    "chart_type": null
  },
  {
    "id": "f96b2747-384a-43ba-9929-c03c5dff0d07",
    "timestamp": "2026-02-13T10:57:04.037975",
    "query": "\n43\nसांडिल्य के एकेडमिक परफॉर्मेंस के बारे में बताएं\n",
    "response": "सांडिल्य मोटुरी के एकेडमिक परफॉर्मेंस के बारे में दस्तावेज़ से प्राप्त जानकारी नीचे दी गई है:\n\n**शैक्षणिक पृष्ठभूमि और प्रदर्शन:**\n\nदस्तावेज़ सांडिल्य मोटुरी की शिक्षा के बारे में जानकारी प्रदान करता है, लेकिन इसमें उनके विशिष्ट अकादमिक प्रदर्शन मेट्रिक्स जैसे कि GPA (ग्रेड पॉइंट एवरेज), प्रतिशत, या कोई विशेष सम्मान (जैसे ऑनर्स या रैंक) का उल्लेख नहीं है। उपलब्ध जानकारी इस प्रकार है:\n\n*   **बैचलर ऑफ टेक्नोलॉजी (B.Tech) - कंप्यूटर साइंस एंड डिज़ाइन:**\n    *   **संस्थान:** SRKR इंजीनियरिंग कॉलेज\n    *   **अवधि:** 2022 से 2026 तक\n    *   यह उनकी वर्तमान स्नातक शिक्षा है।\n\n*   **इंटरमीडिएट (MPC):**\n    *   **संस्थान:** सासी जूनियर कॉलेज\n    *   **अवधि:** 2020 से 2022 तक\n    *   उन्होंने अपनी इंटरमीडिएट शिक्षा MPC (मैथ्स, फिजिक्स, केमिस्ट्री) स्ट्रीम में पूरी की है।\n\n**अकादमिक प्रदर्शन के निहितार्थ (पर अप्रत्यक्ष साक्ष्य):**\n\nहालांकि सीधे ग्रेड या प्रतिशत का उल्लेख नहीं है, सांडिल्य मोटुरी का रिज्यूमे उनके मजबूत तकनीकी कौशल, परियोजनाओं और इंटर्नशिप के माध्यम से एक सक्षम अकादमिक और पेशेवर पृष्ठभूमि का सुझाव देता है। ये कारक अक्सर अच्छे अकादमिक प्रदर्शन के साथ होते हैं:\n\n*   **तकनीकी कौशल:** उन्हें कई प्रोग्रामिंग भाषाओं (Python, C, HTML, CSS, JavaScript, Java), फ्रेमवर्क (React, Node.js), डेवलपर टूल (Git, VS Code), और डेटाबेस (MySQL, PostgreSQL) में दक्षता है। ये कौशल आमतौर पर अकादमिक शिक्षा के दौरान प्राप्त किए जाते हैं।\n*   **परियोजनाएं:** उन्होंने कई महत्वपूर्ण परियोजनाएं की हैं, जैसे 'Magical DB' (जीन इंटरैक्शन को विज़ुअलाइज़ करने वाली वेबसाइट), SVCET कॉलेज वेबसाइट, और SRKR कॉलेज वेबसाइट। इन परियोजनाओं को सफलतापूर्वक पूरा करने के लिए मजबूत अकादमिक अवधारणाओं और समस्या-समाधान कौशल की आवश्यकता होती है।\n*   **प्रमाणन और पाठ्येतर गतिविधियाँ:** उन्होंने C, ReactJS, HTML, CSS जैसे पाठ्यक्रमों में प्रमाणन प्राप्त किया है और स्मार्ट इंडिया हैकथॉन (SIH), वर्डप्रेस और जनरेटिव AI में भी प्रमाणन हैं। उन्होंने एक 18 घंटे का वेबटेक हैकाथॉन भी सफलतापूर्वक आयोजित किया। ये गतिविधियाँ अकादमिक ज्ञान के व्यावहारिक अनुप्रयोग और सीखने की प्रतिबद्धता को दर्शाती हैं।\n\n**सारांश में**, दस्तावेज़ सांडिल्य मोटुरी के शिक्षण संस्थानों और डिग्री के बारे में बताता है, लेकिन उनके अंकों या प्रतिशत के रूप में विशिष्ट अकादमिक प्रदर्शन की जानकारी नहीं देता है। हालांकि, उनके कौशल, परियोजनाएं और प्रमाणन एक मजबूत अकादमिक आधार का संकेत देते हैं।\n\n**Would you like me to:**\n• सांडिल्य मोटुरी के तकनीकी कौशल के बारे में विस्तृत जानकारी प्रदान करें?\n• उनके द्वारा किए गए विभिन्न परियोजनाओं का संक्षिप्त विवरण दें?\n• Create a visual representation of this data",
    "query_type": "general",
    "confidence": 35.67295551300049,
    "sources": [
      {
        "chunk_text": "Sandilya Moturi \n sandilyamoturi347@gmail.com \n 9985111189 \n MyPortFolio \n Sandilya Moturi \n Sandilya Moturi \nEducation \nSRKR Engineering College, \nBachelor of Technology in Computer Science and Design \nSasi Junior College, \nIntermediate , MPC \nExperience \nSoftware Engineer Intern \nBluconn \n2022 – 2026 \nBhimavaram \n2020 – 2022 \nTanuku \n \n \n   Bhimavarm     \nJuly 2024 – present \n◦ Developed and optimized scalable RESTful APIs using NestJS, ensuring high performance and reliability, and wrote comprehensive end-to-\nend test cases to guarantee seamless functionality. \n◦ Crafted a seamless and user-friendly UI for employee management using React, providing an intuitive and engaging experience for users, and \nstreamlining workflows through a responsive and interactive interface. \n◦ Designed and implemented a robust DevOps pipeline using AWS, leveraging its capabilities for secure signup authentication and seamless \nintegration. \n◦ Designed and implemented a robust database architecture using PostgreSQL, ensuring data integrity and scalability, and utilized Docker to \ncreate a containerized environment, enabling easy deployment, management, and scaling of applications. \n◦ Developed an automated overtime request workflow integrated with WhatsApp, enabling employees to easily submit and track overtime \nrequests through a user-friendly chat interface. \nJunior Developer \nMCR Web Solutions \nBhimavarm \nNov 2023 – present \n◦ Designed and developed multiple websites, prioritizing seamless user experiences and intuitive interfaces. \n◦ Successfully organized and executed an 18-hour WebTech Hackathon, managing all aspects of the event, including planning, coordination, and \nlogistics, for over 100 participants. \n◦ Collaborated with cross-functional teams, including developers and tech buddies, to deliver efficient and user- friendly websites, while \noverseeing task assignments, participant management, and logistics. \nSkills \nProgramming Languages: Python, C, HTML, CSS, JavaScript, Java (Basics)  \nFrameworks & Libraries: React, React Native, Electron, Puppeteer, Node.js, Express.js \nDeveloper Tools: Git, VS Code, Postman, Bitbucket, Thunder Client, Linux  \nDatabases: MySQL, MongoDB, PostgreSQL, Firebase \nProjects \nMagical DB \nLink \n \n◦ I developed a dynamic website for visualizing gene interactions, emphasizing clear design and efficient database operations. Continuous \niteration and refinement ensured smooth functionality, optimized user understanding, and streamlined navigation. \n◦ Processed 23M+ gene interactions using HTML, CSS, JS, and PHP, with a focus on search optimization. Im- proved database performance \nthrough efficient schema design and complex query implementation. Enhanced data visualization with Cytoscape library integration. \nSVCET College Website \nLink \n \n◦ Collaborated with a 10-member team to develop an engineering college website, delivering a seamless UI design and efficient user \nexperience that catered to the needs of students, faculty, and administrators. \n◦ Engineered a robust communication framework by integrating EmailJS, enabling seamless interaction between customers and support \nteams; boosted response times by 40% and improved customer satisfaction ratings by 15%. \n◦ Utilized a robust tech stack, including HTML, CSS, Bootstrap, JavaScript, PHP, and MySQL, to deliver a scalable and efficient website \nsolution. \nSRKR College Website \nLink \n \n◦ Crafted an intuitive and responsive UI experience, designing and implementing a user-friendly interface that ensured easy navigation and \naccess to essential information and resources. This included optimizing the website for various devices and screen sizes, ensuring a \nconsistent user experience across different platforms. \n◦ Played a pivotal role in the development and maintenance of our college’s official website , collaborating with stakeholders to design and \nimplement solutions that met their needs and preferences. \n \nCertifications And Extracurricular Activities \nCertification of Courses: C, ReactJs, HTML, CSS \n \n \n \n               Link \n \nCertifications: Smart India Hackathon 24Hrs [SIH], WordPress, Generative AI",
        "metadata": {
          "author": "",
          "processing_date": "2026-02-12T21:35:32.906936",
          "char_count": 4151,
          "topics": "[]",
          "title": "",
          "chunk_type": "paragraph_based",
          "upload_time": "2026-02-12T21:35:33.662553",
          "chunk_id": 0,
          "tables_count": 0,
          "summary": "This document is Sandilya Moturi's professional resume, detailing his academic qualifications, extensive work experience, and technical expertise. He is currently a Software Engineer Intern at Bluconn, focusing on developing scalable RESTful APIs, crafting user-friendly UIs with React, implementing AWS DevOps pipelines, and designing robust PostgreSQL databases. Concurrently, as a Junior Developer at MCR Web Solutions, he has designed multiple websites and successfully organized a large WebTech Hackathon. His portfolio highlights strong skills in full-stack development, including Python, JavaScript, React, Node.js, and various databases, showcased through projects like a gene interaction visualization tool and several college website developments.",
          "creator": "",
          "pages": 1,
          "original_filename": "Resume__Pro.pdf",
          "document_id": "fcbfad1c-7f7e-424e-8312-8c8cf1804f7b",
          "chunk_length": 4148,
          "estimated_reading_time": "2 minutes",
          "document_name": "Resume__Pro.pdf",
          "stored_file_path": "uploads\\5d1c4a08-ea8c-47a2-949a-112865524347.pdf",
          "word_count": 536,
          "images_count": 6,
          "creation_date": "",
          "document_type": "General Document",
          "subject": ""
        },
        "similarity_score": 0.4459119439125061,
        "quality_score": 0.5959119439125061,
        "distance": 0.5540880560874939,
        "relevance_rank": 1
      }
    ],
    "chart_data": null,
    "has_chart": false,
    "chart_type": null
  },
  {
    "id": "d8039fed-fd90-4cdd-86ca-80b757c0f6f6",
    "timestamp": "2026-02-13T10:59:48.701520",
    "query": "who is sandilya",
    "response": "Based on the document provided, **Sandilya Moturi** is an aspiring Software Engineer and Junior Developer with experience in web development, API creation, database design, and DevOps. The document serves as his professional resume or portfolio, highlighting his educational background, work experience, technical skills, projects, and certifications.\n\nHere's a detailed overview of Sandilya Moturi's profile:\n\n### Professional Profile and Contact Information\n*   **Name:** Sandilya Moturi\n*   **Email:** sandilyamoturi347@gmail.com\n*   **Phone:** 9985111189\n*   **Portfolio:** He maintains a portfolio, though the direct link is not provided in the snippet (MyPortFolio).\n\n### Education\nSandilya is currently pursuing or has completed the following education:\n*   **SRKR Engineering College:** Bachelor of Technology in Computer Science and Design (2022 – 2026, Bhimavaram)\n*   **Sasi Junior College:** Intermediate, MPC (Mathematics, Physics, Chemistry) (2020 – 2022, Tanuku)\n\n### Work Experience\nSandilya has gained experience through various roles:\n1.  **Software Engineer Intern at Bluconn (July 2024 – present, Bhimavarm):**\n    *   Developed and optimized scalable RESTful APIs using NestJS, including comprehensive end-to-end test cases.\n    *   Crafted a user-friendly UI for employee management using React, enhancing user experience and streamlining workflows.\n    *   Designed and implemented a robust DevOps pipeline utilizing AWS for secure signup authentication and seamless integration.\n    *   Engineered a robust database architecture with PostgreSQL and deployed applications using Docker for containerization.\n    *   Developed an automated overtime request workflow integrated with WhatsApp.\n2.  **Junior Developer at MCR Web Solutions (Nov 2023 – present, Bhimavarm):**\n    *   Designed and developed multiple websites with a focus on seamless user experiences and intuitive interfaces.\n    *   Successfully organized and executed an 18-hour WebTech Hackathon for over 100 participants, managing planning, coordination, and logistics.\n    *   Collaborated with cross-functional teams, overseeing task assignments and participant management to deliver efficient and user-friendly websites.\n\n### Technical Skills\nSandilya possesses a diverse set of technical skills, including:\n*   **Programming Languages:** Python, C, HTML, CSS, JavaScript, Java (Basics)\n*   **Frameworks & Libraries:** React, React Native, Electron, Puppeteer, Node.js, Express.js\n*   **Developer Tools:** Git, VS Code, Postman, Bitbucket, Thunder Client, Linux\n*   **Databases:** MySQL, MongoDB, PostgreSQL, Firebase\n\n### Key Projects\nHe has contributed to several projects showcasing his capabilities:\n*   **Magical DB:** Developed a dynamic website for visualizing gene interactions, processing **23M+ gene interactions** using HTML, CSS, JS, and PHP. The project included efficient schema design, complex query implementation, and data visualization with the Cytoscape library.\n*   **SVCET College Website:** Collaborated with a 10-member team, integrating EmailJS to **boost response times by 40%** and **improve customer satisfaction ratings by 15%**. The tech stack included HTML, CSS, Bootstrap, JavaScript, PHP, and MySQL.\n*   **SRKR College Website:** Played a pivotal role in developing and maintaining the college's official website, crafting an intuitive and responsive UI optimized for various devices.\n\n### Certifications and Extracurricular Activities\nSandilya has expanded his knowledge through various certifications and activities:\n*   **Certifications of Courses:** C, ReactJs, HTML, CSS\n*   **Other Certifications:** Smart India Hackathon 24Hrs [SIH], WordPress, Generative AI\n\nThe information above is directly sourced from the \"Sandilya Moturi\" document provided, which details his professional and academic journey.\n\n**Would you like me to:**\n• Elaborate on Sandilya's experience with a specific technology, such as NestJS or AWS?\n• Provide a summary of Sandilya's key achievements and quantify his impact?\n• Create a visual representation of this data",
    "query_type": "factual",
    "confidence": 38.39159965515137,
    "sources": [
      {
        "chunk_text": "Sandilya Moturi \n sandilyamoturi347@gmail.com \n 9985111189 \n MyPortFolio \n Sandilya Moturi \n Sandilya Moturi \nEducation \nSRKR Engineering College, \nBachelor of Technology in Computer Science and Design \nSasi Junior College, \nIntermediate , MPC \nExperience \nSoftware Engineer Intern \nBluconn \n2022 – 2026 \nBhimavaram \n2020 – 2022 \nTanuku \n \n \n   Bhimavarm     \nJuly 2024 – present \n◦ Developed and optimized scalable RESTful APIs using NestJS, ensuring high performance and reliability, and wrote comprehensive end-to-\nend test cases to guarantee seamless functionality. \n◦ Crafted a seamless and user-friendly UI for employee management using React, providing an intuitive and engaging experience for users, and \nstreamlining workflows through a responsive and interactive interface. \n◦ Designed and implemented a robust DevOps pipeline using AWS, leveraging its capabilities for secure signup authentication and seamless \nintegration. \n◦ Designed and implemented a robust database architecture using PostgreSQL, ensuring data integrity and scalability, and utilized Docker to \ncreate a containerized environment, enabling easy deployment, management, and scaling of applications. \n◦ Developed an automated overtime request workflow integrated with WhatsApp, enabling employees to easily submit and track overtime \nrequests through a user-friendly chat interface. \nJunior Developer \nMCR Web Solutions \nBhimavarm \nNov 2023 – present \n◦ Designed and developed multiple websites, prioritizing seamless user experiences and intuitive interfaces. \n◦ Successfully organized and executed an 18-hour WebTech Hackathon, managing all aspects of the event, including planning, coordination, and \nlogistics, for over 100 participants. \n◦ Collaborated with cross-functional teams, including developers and tech buddies, to deliver efficient and user- friendly websites, while \noverseeing task assignments, participant management, and logistics. \nSkills \nProgramming Languages: Python, C, HTML, CSS, JavaScript, Java (Basics)  \nFrameworks & Libraries: React, React Native, Electron, Puppeteer, Node.js, Express.js \nDeveloper Tools: Git, VS Code, Postman, Bitbucket, Thunder Client, Linux  \nDatabases: MySQL, MongoDB, PostgreSQL, Firebase \nProjects \nMagical DB \nLink \n \n◦ I developed a dynamic website for visualizing gene interactions, emphasizing clear design and efficient database operations. Continuous \niteration and refinement ensured smooth functionality, optimized user understanding, and streamlined navigation. \n◦ Processed 23M+ gene interactions using HTML, CSS, JS, and PHP, with a focus on search optimization. Im- proved database performance \nthrough efficient schema design and complex query implementation. Enhanced data visualization with Cytoscape library integration. \nSVCET College Website \nLink \n \n◦ Collaborated with a 10-member team to develop an engineering college website, delivering a seamless UI design and efficient user \nexperience that catered to the needs of students, faculty, and administrators. \n◦ Engineered a robust communication framework by integrating EmailJS, enabling seamless interaction between customers and support \nteams; boosted response times by 40% and improved customer satisfaction ratings by 15%. \n◦ Utilized a robust tech stack, including HTML, CSS, Bootstrap, JavaScript, PHP, and MySQL, to deliver a scalable and efficient website \nsolution. \nSRKR College Website \nLink \n \n◦ Crafted an intuitive and responsive UI experience, designing and implementing a user-friendly interface that ensured easy navigation and \naccess to essential information and resources. This included optimizing the website for various devices and screen sizes, ensuring a \nconsistent user experience across different platforms. \n◦ Played a pivotal role in the development and maintenance of our college’s official website , collaborating with stakeholders to design and \nimplement solutions that met their needs and preferences. \n \nCertifications And Extracurricular Activities \nCertification of Courses: C, ReactJs, HTML, CSS \n \n \n \n               Link \n \nCertifications: Smart India Hackathon 24Hrs [SIH], WordPress, Generative AI",
        "metadata": {
          "chunk_type": "paragraph_based",
          "author": "",
          "images_count": 6,
          "creation_date": "",
          "upload_time": "2026-02-12T21:35:33.662553",
          "pages": 1,
          "original_filename": "Resume__Pro.pdf",
          "document_name": "Resume__Pro.pdf",
          "stored_file_path": "uploads\\5d1c4a08-ea8c-47a2-949a-112865524347.pdf",
          "topics": "[]",
          "summary": "This document is Sandilya Moturi's professional resume, detailing his academic qualifications, extensive work experience, and technical expertise. He is currently a Software Engineer Intern at Bluconn, focusing on developing scalable RESTful APIs, crafting user-friendly UIs with React, implementing AWS DevOps pipelines, and designing robust PostgreSQL databases. Concurrently, as a Junior Developer at MCR Web Solutions, he has designed multiple websites and successfully organized a large WebTech Hackathon. His portfolio highlights strong skills in full-stack development, including Python, JavaScript, React, Node.js, and various databases, showcased through projects like a gene interaction visualization tool and several college website developments.",
          "document_type": "General Document",
          "estimated_reading_time": "2 minutes",
          "char_count": 4151,
          "title": "",
          "chunk_length": 4148,
          "tables_count": 0,
          "creator": "",
          "document_id": "fcbfad1c-7f7e-424e-8312-8c8cf1804f7b",
          "processing_date": "2026-02-12T21:35:32.906936",
          "subject": "",
          "word_count": 536,
          "chunk_id": 0
        },
        "similarity_score": 0.4798949956893921,
        "quality_score": 0.6298949956893921,
        "distance": 0.5201050043106079,
        "relevance_rank": 1
      }
    ],
    "chart_data": null,
    "has_chart": false,
    "chart_type": null
  }
]